my-scenario.yml
# my-scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 100
      arrivalRate: 50
  engines:
   socketio-v3: {}

scenarios:
  - name: My sample scenario
    engine: socketio-v3
    flow:
      # wait for the WebSocket upgrade (optional)
      - think: 1

      # basic emit
      - emit:
          channel: "hello"
          data: "world"

     # do nothing for 30 seconds then disconnect
      - think: 300